espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG27/Include/efr32bg27_etampdet.h
/** @} End of group EFR32BG27_ETAMPDET */

/**************************************************************************//**
 * @addtogroup EFR32BG27_ETAMPDET
 * @{
 * @defgroup EFR32BG27_ETAMPDET_BitFields ETAMPDET Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for ETAMPDET IPVERSION */
#define _ETAMPDET_IPVERSION_RESETVALUE                                            0x00000002UL                                 /**< Default value for ETAMPDET_IPVERSION        */
#define _ETAMPDET_IPVERSION_MASK                                                  0xFFFFFFFFUL                                 /**< Mask for ETAMPDET_IPVERSION                 */
#define _ETAMPDET_IPVERSION_IPVERSION_SHIFT                                       0                                            /**< Shift value for ETAMPDET_IPVERSION          */
#define _ETAMPDET_IPVERSION_IPVERSION_MASK                                        0xFFFFFFFFUL                                 /**< Bit mask for ETAMPDET_IPVERSION             */
#define _ETAMPDET_IPVERSION_IPVERSION_DEFAULT                                     0x00000002UL                                 /**< Mode DEFAULT for ETAMPDET_IPVERSION         */
#define ETAMPDET_IPVERSION_IPVERSION_DEFAULT                                      (_ETAMPDET_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_IPVERSION */

/* Bit fields for ETAMPDET EN */
#define _ETAMPDET_EN_RESETVALUE                                                   0x00000000UL                   /**< Default value for ETAMPDET_EN               */
#define _ETAMPDET_EN_MASK                                                         0x00000001UL                   /**< Mask for ETAMPDET_EN                        */
#define ETAMPDET_EN_EN                                                            (0x1UL << 0)                   /**< ETAMPDET Enable                             */
#define _ETAMPDET_EN_EN_SHIFT                                                     0                              /**< Shift value for ETAMPDET_EN                 */
#define _ETAMPDET_EN_EN_MASK                                                      0x1UL                          /**< Bit mask for ETAMPDET_EN                    */
#define _ETAMPDET_EN_EN_DEFAULT                                                   0x00000000UL                   /**< Mode DEFAULT for ETAMPDET_EN                */
#define ETAMPDET_EN_EN_DEFAULT                                                    (_ETAMPDET_EN_EN_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_EN        */

/* Bit fields for ETAMPDET CFG */
#define _ETAMPDET_CFG_RESETVALUE                                                  0x00000000UL                                    /**< Default value for ETAMPDET_CFG              */
#define _ETAMPDET_CFG_MASK                                                        0x0000003FUL                                    /**< Mask for ETAMPDET_CFG                       */
#define ETAMPDET_CFG_CHNLCMPDLYEN0                                                (0x1UL << 0)                                    /**< enable delay for comparison                 */
#define _ETAMPDET_CFG_CHNLCMPDLYEN0_SHIFT                                         0                                               /**< Shift value for ETAMPDET_CHNLCMPDLYEN0      */
#define _ETAMPDET_CFG_CHNLCMPDLYEN0_MASK                                          0x1UL                                           /**< Bit mask for ETAMPDET_CHNLCMPDLYEN0         */
#define _ETAMPDET_CFG_CHNLCMPDLYEN0_DEFAULT                                       0x00000000UL                                    /**< Mode DEFAULT for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLCMPDLYEN0_X0                                            0x00000000UL                                    /**< Mode X0 for ETAMPDET_CFG                    */
#define _ETAMPDET_CFG_CHNLCMPDLYEN0_X1                                            0x00000001UL                                    /**< Mode X1 for ETAMPDET_CFG                    */
#define ETAMPDET_CFG_CHNLCMPDLYEN0_DEFAULT                                        (_ETAMPDET_CFG_CHNLCMPDLYEN0_DEFAULT << 0)      /**< Shifted mode DEFAULT for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLCMPDLYEN0_X0                                             (_ETAMPDET_CFG_CHNLCMPDLYEN0_X0 << 0)           /**< Shifted mode X0 for ETAMPDET_CFG            */
#define ETAMPDET_CFG_CHNLCMPDLYEN0_X1                                             (_ETAMPDET_CFG_CHNLCMPDLYEN0_X1 << 0)           /**< Shifted mode X1 for ETAMPDET_CFG            */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN0                                           (0x1UL << 1)                                    /**< enable detect filtering                     */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN0_SHIFT                                    1                                               /**< Shift value for ETAMPDET_CHNLTAMPDETFILTEN0 */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN0_MASK                                     0x2UL                                           /**< Bit mask for ETAMPDET_CHNLTAMPDETFILTEN0    */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN0_DEFAULT                                  0x00000000UL                                    /**< Mode DEFAULT for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN0_DISABLE                                  0x00000000UL                                    /**< Mode DISABLE for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN0_ENABLE                                   0x00000001UL                                    /**< Mode ENABLE for ETAMPDET_CFG                */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN0_DEFAULT                                   (_ETAMPDET_CFG_CHNLTAMPDETFILTEN0_DEFAULT << 1) /**< Shifted mode DEFAULT for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN0_DISABLE                                   (_ETAMPDET_CFG_CHNLTAMPDETFILTEN0_DISABLE << 1) /**< Shifted mode DISABLE for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN0_ENABLE                                    (_ETAMPDET_CFG_CHNLTAMPDETFILTEN0_ENABLE << 1)  /**< Shifted mode ENABLE for ETAMPDET_CFG        */
#define ETAMPDET_CFG_CHNLPADEN0                                                   (0x1UL << 2)                                    /**< enable driving pad                          */
#define _ETAMPDET_CFG_CHNLPADEN0_SHIFT                                            2                                               /**< Shift value for ETAMPDET_CHNLPADEN0         */
#define _ETAMPDET_CFG_CHNLPADEN0_MASK                                             0x4UL                                           /**< Bit mask for ETAMPDET_CHNLPADEN0            */
#define _ETAMPDET_CFG_CHNLPADEN0_DEFAULT                                          0x00000000UL                                    /**< Mode DEFAULT for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLPADEN0_DISABLE                                          0x00000000UL                                    /**< Mode DISABLE for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLPADEN0_ENABLE                                           0x00000001UL                                    /**< Mode ENABLE for ETAMPDET_CFG                */
#define ETAMPDET_CFG_CHNLPADEN0_DEFAULT                                           (_ETAMPDET_CFG_CHNLPADEN0_DEFAULT << 2)         /**< Shifted mode DEFAULT for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLPADEN0_DISABLE                                           (_ETAMPDET_CFG_CHNLPADEN0_DISABLE << 2)         /**< Shifted mode DISABLE for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLPADEN0_ENABLE                                            (_ETAMPDET_CFG_CHNLPADEN0_ENABLE << 2)          /**< Shifted mode ENABLE for ETAMPDET_CFG        */
#define ETAMPDET_CFG_CHNLCMPDLYEN1                                                (0x1UL << 3)                                    /**< enable delay for comparison                 */
#define _ETAMPDET_CFG_CHNLCMPDLYEN1_SHIFT                                         3                                               /**< Shift value for ETAMPDET_CHNLCMPDLYEN1      */
#define _ETAMPDET_CFG_CHNLCMPDLYEN1_MASK                                          0x8UL                                           /**< Bit mask for ETAMPDET_CHNLCMPDLYEN1         */
#define _ETAMPDET_CFG_CHNLCMPDLYEN1_DEFAULT                                       0x00000000UL                                    /**< Mode DEFAULT for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLCMPDLYEN1_DISABLE                                       0x00000000UL                                    /**< Mode DISABLE for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLCMPDLYEN1_ENABLE                                        0x00000001UL                                    /**< Mode ENABLE for ETAMPDET_CFG                */
#define ETAMPDET_CFG_CHNLCMPDLYEN1_DEFAULT                                        (_ETAMPDET_CFG_CHNLCMPDLYEN1_DEFAULT << 3)      /**< Shifted mode DEFAULT for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLCMPDLYEN1_DISABLE                                        (_ETAMPDET_CFG_CHNLCMPDLYEN1_DISABLE << 3)      /**< Shifted mode DISABLE for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLCMPDLYEN1_ENABLE                                         (_ETAMPDET_CFG_CHNLCMPDLYEN1_ENABLE << 3)       /**< Shifted mode ENABLE for ETAMPDET_CFG        */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN1                                           (0x1UL << 4)                                    /**< enable detect filtering                     */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN1_SHIFT                                    4                                               /**< Shift value for ETAMPDET_CHNLTAMPDETFILTEN1 */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN1_MASK                                     0x10UL                                          /**< Bit mask for ETAMPDET_CHNLTAMPDETFILTEN1    */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN1_DEFAULT                                  0x00000000UL                                    /**< Mode DEFAULT for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN1_DISABLE                                  0x00000000UL                                    /**< Mode DISABLE for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLTAMPDETFILTEN1_ENABLE                                   0x00000001UL                                    /**< Mode ENABLE for ETAMPDET_CFG                */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN1_DEFAULT                                   (_ETAMPDET_CFG_CHNLTAMPDETFILTEN1_DEFAULT << 4) /**< Shifted mode DEFAULT for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN1_DISABLE                                   (_ETAMPDET_CFG_CHNLTAMPDETFILTEN1_DISABLE << 4) /**< Shifted mode DISABLE for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLTAMPDETFILTEN1_ENABLE                                    (_ETAMPDET_CFG_CHNLTAMPDETFILTEN1_ENABLE << 4)  /**< Shifted mode ENABLE for ETAMPDET_CFG        */
#define ETAMPDET_CFG_CHNLPADEN1                                                   (0x1UL << 5)                                    /**< enable driving pad                          */
#define _ETAMPDET_CFG_CHNLPADEN1_SHIFT                                            5                                               /**< Shift value for ETAMPDET_CHNLPADEN1         */
#define _ETAMPDET_CFG_CHNLPADEN1_MASK                                             0x20UL                                          /**< Bit mask for ETAMPDET_CHNLPADEN1            */
#define _ETAMPDET_CFG_CHNLPADEN1_DEFAULT                                          0x00000000UL                                    /**< Mode DEFAULT for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLPADEN1_DISABLE                                          0x00000000UL                                    /**< Mode DISABLE for ETAMPDET_CFG               */
#define _ETAMPDET_CFG_CHNLPADEN1_ENABLE                                           0x00000001UL                                    /**< Mode ENABLE for ETAMPDET_CFG                */
#define ETAMPDET_CFG_CHNLPADEN1_DEFAULT                                           (_ETAMPDET_CFG_CHNLPADEN1_DEFAULT << 5)         /**< Shifted mode DEFAULT for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLPADEN1_DISABLE                                           (_ETAMPDET_CFG_CHNLPADEN1_DISABLE << 5)         /**< Shifted mode DISABLE for ETAMPDET_CFG       */
#define ETAMPDET_CFG_CHNLPADEN1_ENABLE                                            (_ETAMPDET_CFG_CHNLPADEN1_ENABLE << 5)          /**< Shifted mode ENABLE for ETAMPDET_CFG        */

/* Bit fields for ETAMPDET CNTMISMATCHMAX */
#define _ETAMPDET_CNTMISMATCHMAX_RESETVALUE                                       0x00000000UL                                                               /**< Default value for ETAMPDET_CNTMISMATCHMAX   */
#define _ETAMPDET_CNTMISMATCHMAX_MASK                                             0x0000003FUL                                                               /**< Mask for ETAMPDET_CNTMISMATCHMAX            */
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_SHIFT                        0                                                                          /**< Shift value for ETAMPDET_CHNLCNTMISMATCHMAX0*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_MASK                         0x7UL                                                                      /**< Bit mask for ETAMPDET_CHNLCNTMISMATCHMAX0   */
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DEFAULT                      0x00000000UL                                                               /**< Mode DEFAULT for ETAMPDET_CNTMISMATCHMAX    */
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold1       0x00000000UL                                                               /**< Mode DetectFilterThreshold1 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold2       0x00000001UL                                                               /**< Mode DetectFilterThreshold2 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold3       0x00000002UL                                                               /**< Mode DetectFilterThreshold3 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold4       0x00000003UL                                                               /**< Mode DetectFilterThreshold4 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold5       0x00000004UL                                                               /**< Mode DetectFilterThreshold5 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold6       0x00000005UL                                                               /**< Mode DetectFilterThreshold6 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold7       0x00000006UL                                                               /**< Mode DetectFilterThreshold7 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold8       0x00000007UL                                                               /**< Mode DetectFilterThreshold8 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DEFAULT                       (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DEFAULT << 0)                /**< Shifted mode DEFAULT for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold1        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold1 << 0) /**< Shifted mode DetectFilterThreshold1 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold2        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold2 << 0) /**< Shifted mode DetectFilterThreshold2 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold3        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold3 << 0) /**< Shifted mode DetectFilterThreshold3 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold4        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold4 << 0) /**< Shifted mode DetectFilterThreshold4 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold5        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold5 << 0) /**< Shifted mode DetectFilterThreshold5 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold6        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold6 << 0) /**< Shifted mode DetectFilterThreshold6 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold7        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold7 << 0) /**< Shifted mode DetectFilterThreshold7 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold8        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX0_DetectFilterThreshold8 << 0) /**< Shifted mode DetectFilterThreshold8 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_SHIFT                        3                                                                          /**< Shift value for ETAMPDET_CHNLCNTMISMATCHMAX1*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_MASK                         0x38UL                                                                     /**< Bit mask for ETAMPDET_CHNLCNTMISMATCHMAX1   */
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DEFAULT                      0x00000000UL                                                               /**< Mode DEFAULT for ETAMPDET_CNTMISMATCHMAX    */
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold1       0x00000000UL                                                               /**< Mode DetectFilterThreshold1 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold2       0x00000001UL                                                               /**< Mode DetectFilterThreshold2 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold3       0x00000002UL                                                               /**< Mode DetectFilterThreshold3 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold4       0x00000003UL                                                               /**< Mode DetectFilterThreshold4 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold5       0x00000004UL                                                               /**< Mode DetectFilterThreshold5 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold6       0x00000005UL                                                               /**< Mode DetectFilterThreshold6 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold7       0x00000006UL                                                               /**< Mode DetectFilterThreshold7 for ETAMPDET_CNTMISMATCHMAX*/
#define _ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold8       0x00000007UL                                                               /**< Mode DetectFilterThreshold8 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DEFAULT                       (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DEFAULT << 3)                /**< Shifted mode DEFAULT for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold1        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold1 << 3) /**< Shifted mode DetectFilterThreshold1 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold2        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold2 << 3) /**< Shifted mode DetectFilterThreshold2 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold3        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold3 << 3) /**< Shifted mode DetectFilterThreshold3 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold4        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold4 << 3) /**< Shifted mode DetectFilterThreshold4 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold5        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold5 << 3) /**< Shifted mode DetectFilterThreshold5 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold6        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold6 << 3) /**< Shifted mode DetectFilterThreshold6 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold7        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold7 << 3) /**< Shifted mode DetectFilterThreshold7 for ETAMPDET_CNTMISMATCHMAX*/
#define ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold8        (_ETAMPDET_CNTMISMATCHMAX_CHNLCNTMISMATCHMAX1_DetectFilterThreshold8 << 3) /**< Shifted mode DetectFilterThreshold8 for ETAMPDET_CNTMISMATCHMAX*/

