espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG27/Include/efr32bg27_etampdet.h
/* Bit fields for ETAMPDET SYNCBUSY */
#define _ETAMPDET_SYNCBUSY_RESETVALUE                                             0x00000000UL                                 /**< Default value for ETAMPDET_SYNCBUSY         */
#define _ETAMPDET_SYNCBUSY_MASK                                                   0x0000007FUL                                 /**< Mask for ETAMPDET_SYNCBUSY                  */
#define ETAMPDET_SYNCBUSY_CHNLSTART0                                              (0x1UL << 0)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_CHNLSTART0_SHIFT                                       0                                            /**< Shift value for ETAMPDET_CHNLSTART0         */
#define _ETAMPDET_SYNCBUSY_CHNLSTART0_MASK                                        0x1UL                                        /**< Bit mask for ETAMPDET_CHNLSTART0            */
#define _ETAMPDET_SYNCBUSY_CHNLSTART0_DEFAULT                                     0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_CHNLSTART0_DEFAULT                                      (_ETAMPDET_SYNCBUSY_CHNLSTART0_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */
#define ETAMPDET_SYNCBUSY_CHNLSTOP0                                               (0x1UL << 1)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_CHNLSTOP0_SHIFT                                        1                                            /**< Shift value for ETAMPDET_CHNLSTOP0          */
#define _ETAMPDET_SYNCBUSY_CHNLSTOP0_MASK                                         0x2UL                                        /**< Bit mask for ETAMPDET_CHNLSTOP0             */
#define _ETAMPDET_SYNCBUSY_CHNLSTOP0_DEFAULT                                      0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_CHNLSTOP0_DEFAULT                                       (_ETAMPDET_SYNCBUSY_CHNLSTOP0_DEFAULT << 1)  /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */
#define ETAMPDET_SYNCBUSY_CHNLLOAD0                                               (0x1UL << 2)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_CHNLLOAD0_SHIFT                                        2                                            /**< Shift value for ETAMPDET_CHNLLOAD0          */
#define _ETAMPDET_SYNCBUSY_CHNLLOAD0_MASK                                         0x4UL                                        /**< Bit mask for ETAMPDET_CHNLLOAD0             */
#define _ETAMPDET_SYNCBUSY_CHNLLOAD0_DEFAULT                                      0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_CHNLLOAD0_DEFAULT                                       (_ETAMPDET_SYNCBUSY_CHNLLOAD0_DEFAULT << 2)  /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */
#define ETAMPDET_SYNCBUSY_CHNLSTART1                                              (0x1UL << 3)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_CHNLSTART1_SHIFT                                       3                                            /**< Shift value for ETAMPDET_CHNLSTART1         */
#define _ETAMPDET_SYNCBUSY_CHNLSTART1_MASK                                        0x8UL                                        /**< Bit mask for ETAMPDET_CHNLSTART1            */
#define _ETAMPDET_SYNCBUSY_CHNLSTART1_DEFAULT                                     0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_CHNLSTART1_DEFAULT                                      (_ETAMPDET_SYNCBUSY_CHNLSTART1_DEFAULT << 3) /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */
#define ETAMPDET_SYNCBUSY_CHNLSTOP1                                               (0x1UL << 4)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_CHNLSTOP1_SHIFT                                        4                                            /**< Shift value for ETAMPDET_CHNLSTOP1          */
#define _ETAMPDET_SYNCBUSY_CHNLSTOP1_MASK                                         0x10UL                                       /**< Bit mask for ETAMPDET_CHNLSTOP1             */
#define _ETAMPDET_SYNCBUSY_CHNLSTOP1_DEFAULT                                      0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_CHNLSTOP1_DEFAULT                                       (_ETAMPDET_SYNCBUSY_CHNLSTOP1_DEFAULT << 4)  /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */
#define ETAMPDET_SYNCBUSY_CHNLLOAD1                                               (0x1UL << 5)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_CHNLLOAD1_SHIFT                                        5                                            /**< Shift value for ETAMPDET_CHNLLOAD1          */
#define _ETAMPDET_SYNCBUSY_CHNLLOAD1_MASK                                         0x20UL                                       /**< Bit mask for ETAMPDET_CHNLLOAD1             */
#define _ETAMPDET_SYNCBUSY_CHNLLOAD1_DEFAULT                                      0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_CHNLLOAD1_DEFAULT                                       (_ETAMPDET_SYNCBUSY_CHNLLOAD1_DEFAULT << 5)  /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */
#define ETAMPDET_SYNCBUSY_EN                                                      (0x1UL << 6)                                 /**< Synchronizer busy status                    */
#define _ETAMPDET_SYNCBUSY_EN_SHIFT                                               6                                            /**< Shift value for ETAMPDET_EN                 */
#define _ETAMPDET_SYNCBUSY_EN_MASK                                                0x40UL                                       /**< Bit mask for ETAMPDET_EN                    */
#define _ETAMPDET_SYNCBUSY_EN_DEFAULT                                             0x00000000UL                                 /**< Mode DEFAULT for ETAMPDET_SYNCBUSY          */
#define ETAMPDET_SYNCBUSY_EN_DEFAULT                                              (_ETAMPDET_SYNCBUSY_EN_DEFAULT << 6)         /**< Shifted mode DEFAULT for ETAMPDET_SYNCBUSY  */

/* Bit fields for ETAMPDET IEN */
#define _ETAMPDET_IEN_RESETVALUE                                                  0x00000000UL                             /**< Default value for ETAMPDET_IEN              */
#define _ETAMPDET_IEN_MASK                                                        0x00000003UL                             /**< Mask for ETAMPDET_IEN                       */
#define ETAMPDET_IEN_TAMPDET0IEN                                                  (0x1UL << 0)                             /**< TAMPDET0 interrupt enable                   */
#define _ETAMPDET_IEN_TAMPDET0IEN_SHIFT                                           0                                        /**< Shift value for ETAMPDET_TAMPDET0IEN        */
#define _ETAMPDET_IEN_TAMPDET0IEN_MASK                                            0x1UL                                    /**< Bit mask for ETAMPDET_TAMPDET0IEN           */
#define _ETAMPDET_IEN_TAMPDET0IEN_DEFAULT                                         0x00000000UL                             /**< Mode DEFAULT for ETAMPDET_IEN               */
#define ETAMPDET_IEN_TAMPDET0IEN_DEFAULT                                          (_ETAMPDET_IEN_TAMPDET0IEN_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_IEN       */
#define ETAMPDET_IEN_TAMPDET1IEN                                                  (0x1UL << 1)                             /**< TAMPDET1 interrupt enable                   */
#define _ETAMPDET_IEN_TAMPDET1IEN_SHIFT                                           1                                        /**< Shift value for ETAMPDET_TAMPDET1IEN        */
#define _ETAMPDET_IEN_TAMPDET1IEN_MASK                                            0x2UL                                    /**< Bit mask for ETAMPDET_TAMPDET1IEN           */
#define _ETAMPDET_IEN_TAMPDET1IEN_DEFAULT                                         0x00000000UL                             /**< Mode DEFAULT for ETAMPDET_IEN               */
#define ETAMPDET_IEN_TAMPDET1IEN_DEFAULT                                          (_ETAMPDET_IEN_TAMPDET1IEN_DEFAULT << 1) /**< Shifted mode DEFAULT for ETAMPDET_IEN       */

/* Bit fields for ETAMPDET IF */
#define _ETAMPDET_IF_RESETVALUE                                                   0x00000000UL                           /**< Default value for ETAMPDET_IF               */
#define _ETAMPDET_IF_MASK                                                         0x00000003UL                           /**< Mask for ETAMPDET_IF                        */
#define ETAMPDET_IF_TAMPDET0IF                                                    (0x1UL << 0)                           /**< Tamper0 Detect Flag                         */
#define _ETAMPDET_IF_TAMPDET0IF_SHIFT                                             0                                      /**< Shift value for ETAMPDET_TAMPDET0IF         */
#define _ETAMPDET_IF_TAMPDET0IF_MASK                                              0x1UL                                  /**< Bit mask for ETAMPDET_TAMPDET0IF            */
#define _ETAMPDET_IF_TAMPDET0IF_DEFAULT                                           0x00000000UL                           /**< Mode DEFAULT for ETAMPDET_IF                */
#define ETAMPDET_IF_TAMPDET0IF_DEFAULT                                            (_ETAMPDET_IF_TAMPDET0IF_DEFAULT << 0) /**< Shifted mode DEFAULT for ETAMPDET_IF        */
#define ETAMPDET_IF_TAMPDET1IF                                                    (0x1UL << 1)                           /**< Tamper1 Detect Flag                         */
#define _ETAMPDET_IF_TAMPDET1IF_SHIFT                                             1                                      /**< Shift value for ETAMPDET_TAMPDET1IF         */
#define _ETAMPDET_IF_TAMPDET1IF_MASK                                              0x2UL                                  /**< Bit mask for ETAMPDET_TAMPDET1IF            */
#define _ETAMPDET_IF_TAMPDET1IF_DEFAULT                                           0x00000000UL                           /**< Mode DEFAULT for ETAMPDET_IF                */
#define ETAMPDET_IF_TAMPDET1IF_DEFAULT                                            (_ETAMPDET_IF_TAMPDET1IF_DEFAULT << 1) /**< Shifted mode DEFAULT for ETAMPDET_IF        */

