espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG27/Include/efr32bg27_etampdet.h
/* Bit fields for ETAMPDET CLKPRESCVAL */
#define _ETAMPDET_CLKPRESCVAL_RESETVALUE                                          0x00000000UL                                       /**< Default value for ETAMPDET_CLKPRESCVAL      */
#define _ETAMPDET_CLKPRESCVAL_MASK                                                0x0000073FUL                                       /**< Mask for ETAMPDET_CLKPRESCVAL               */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_SHIFT                                    0                                                  /**< Shift value for ETAMPDET_LOWERPRESC         */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_MASK                                     0x3FUL                                             /**< Bit mask for ETAMPDET_LOWERPRESC            */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DEFAULT                                  0x00000000UL                                       /**< Mode DEFAULT for ETAMPDET_CLKPRESCVAL       */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_Bypass                                   0x00000000UL                                       /**< Mode Bypass for ETAMPDET_CLKPRESCVAL        */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy2                                0x00000001UL                                       /**< Mode DivideBy2 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy3                                0x00000002UL                                       /**< Mode DivideBy3 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy4                                0x00000003UL                                       /**< Mode DivideBy4 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy5                                0x00000004UL                                       /**< Mode DivideBy5 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy6                                0x00000005UL                                       /**< Mode DivideBy6 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy7                                0x00000006UL                                       /**< Mode DivideBy7 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy8                                0x00000007UL                                       /**< Mode DivideBy8 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy9                                0x00000008UL                                       /**< Mode DivideBy9 for ETAMPDET_CLKPRESCVAL     */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy10                               0x00000009UL                                       /**< Mode DivideBy10 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy11                               0x0000000AUL                                       /**< Mode DivideBy11 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy12                               0x0000000BUL                                       /**< Mode DivideBy12 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy13                               0x0000000CUL                                       /**< Mode DivideBy13 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy14                               0x0000000DUL                                       /**< Mode DivideBy14 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy15                               0x0000000EUL                                       /**< Mode DivideBy15 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy16                               0x0000000FUL                                       /**< Mode DivideBy16 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy17                               0x00000010UL                                       /**< Mode DivideBy17 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy18                               0x00000011UL                                       /**< Mode DivideBy18 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy19                               0x00000012UL                                       /**< Mode DivideBy19 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy20                               0x00000013UL                                       /**< Mode DivideBy20 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy21                               0x00000014UL                                       /**< Mode DivideBy21 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy22                               0x00000015UL                                       /**< Mode DivideBy22 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy23                               0x00000016UL                                       /**< Mode DivideBy23 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy24                               0x00000017UL                                       /**< Mode DivideBy24 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy25                               0x00000018UL                                       /**< Mode DivideBy25 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy26                               0x00000019UL                                       /**< Mode DivideBy26 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy27                               0x0000001AUL                                       /**< Mode DivideBy27 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy28                               0x0000001BUL                                       /**< Mode DivideBy28 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy29                               0x0000001CUL                                       /**< Mode DivideBy29 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy30                               0x0000001DUL                                       /**< Mode DivideBy30 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy31                               0x0000001EUL                                       /**< Mode DivideBy31 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy32                               0x0000001FUL                                       /**< Mode DivideBy32 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy33                               0x00000020UL                                       /**< Mode DivideBy33 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy34                               0x00000021UL                                       /**< Mode DivideBy34 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy35                               0x00000022UL                                       /**< Mode DivideBy35 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy36                               0x00000023UL                                       /**< Mode DivideBy36 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy37                               0x00000024UL                                       /**< Mode DivideBy37 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy38                               0x00000025UL                                       /**< Mode DivideBy38 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy39                               0x00000026UL                                       /**< Mode DivideBy39 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy40                               0x00000027UL                                       /**< Mode DivideBy40 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy41                               0x00000028UL                                       /**< Mode DivideBy41 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy42                               0x00000029UL                                       /**< Mode DivideBy42 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy43                               0x0000002AUL                                       /**< Mode DivideBy43 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy44                               0x0000002BUL                                       /**< Mode DivideBy44 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy45                               0x0000002CUL                                       /**< Mode DivideBy45 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy46                               0x0000002DUL                                       /**< Mode DivideBy46 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy47                               0x0000002EUL                                       /**< Mode DivideBy47 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy48                               0x0000002FUL                                       /**< Mode DivideBy48 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy49                               0x00000030UL                                       /**< Mode DivideBy49 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy50                               0x00000031UL                                       /**< Mode DivideBy50 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy51                               0x00000032UL                                       /**< Mode DivideBy51 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy52                               0x00000033UL                                       /**< Mode DivideBy52 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy53                               0x00000034UL                                       /**< Mode DivideBy53 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy54                               0x00000035UL                                       /**< Mode DivideBy54 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy55                               0x00000036UL                                       /**< Mode DivideBy55 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy56                               0x00000037UL                                       /**< Mode DivideBy56 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy57                               0x00000038UL                                       /**< Mode DivideBy57 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy58                               0x00000039UL                                       /**< Mode DivideBy58 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy59                               0x0000003AUL                                       /**< Mode DivideBy59 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy60                               0x0000003BUL                                       /**< Mode DivideBy60 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy61                               0x0000003CUL                                       /**< Mode DivideBy61 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy62                               0x0000003DUL                                       /**< Mode DivideBy62 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy63                               0x0000003EUL                                       /**< Mode DivideBy63 for ETAMPDET_CLKPRESCVAL    */
#define _ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy64                               0x0000003FUL                                       /**< Mode DivideBy64 for ETAMPDET_CLKPRESCVAL    */
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DEFAULT                                   (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DEFAULT << 0)    /**< Shifted mode DEFAULT for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_Bypass                                    (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_Bypass << 0)     /**< Shifted mode Bypass for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy2                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy2 << 0)  /**< Shifted mode DivideBy2 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy3                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy3 << 0)  /**< Shifted mode DivideBy3 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy4                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy4 << 0)  /**< Shifted mode DivideBy4 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy5                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy5 << 0)  /**< Shifted mode DivideBy5 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy6                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy6 << 0)  /**< Shifted mode DivideBy6 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy7                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy7 << 0)  /**< Shifted mode DivideBy7 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy8                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy8 << 0)  /**< Shifted mode DivideBy8 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy9                                 (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy9 << 0)  /**< Shifted mode DivideBy9 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy10                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy10 << 0) /**< Shifted mode DivideBy10 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy11                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy11 << 0) /**< Shifted mode DivideBy11 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy12                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy12 << 0) /**< Shifted mode DivideBy12 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy13                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy13 << 0) /**< Shifted mode DivideBy13 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy14                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy14 << 0) /**< Shifted mode DivideBy14 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy15                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy15 << 0) /**< Shifted mode DivideBy15 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy16                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy16 << 0) /**< Shifted mode DivideBy16 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy17                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy17 << 0) /**< Shifted mode DivideBy17 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy18                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy18 << 0) /**< Shifted mode DivideBy18 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy19                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy19 << 0) /**< Shifted mode DivideBy19 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy20                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy20 << 0) /**< Shifted mode DivideBy20 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy21                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy21 << 0) /**< Shifted mode DivideBy21 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy22                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy22 << 0) /**< Shifted mode DivideBy22 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy23                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy23 << 0) /**< Shifted mode DivideBy23 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy24                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy24 << 0) /**< Shifted mode DivideBy24 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy25                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy25 << 0) /**< Shifted mode DivideBy25 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy26                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy26 << 0) /**< Shifted mode DivideBy26 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy27                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy27 << 0) /**< Shifted mode DivideBy27 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy28                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy28 << 0) /**< Shifted mode DivideBy28 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy29                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy29 << 0) /**< Shifted mode DivideBy29 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy30                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy30 << 0) /**< Shifted mode DivideBy30 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy31                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy31 << 0) /**< Shifted mode DivideBy31 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy32                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy32 << 0) /**< Shifted mode DivideBy32 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy33                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy33 << 0) /**< Shifted mode DivideBy33 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy34                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy34 << 0) /**< Shifted mode DivideBy34 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy35                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy35 << 0) /**< Shifted mode DivideBy35 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy36                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy36 << 0) /**< Shifted mode DivideBy36 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy37                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy37 << 0) /**< Shifted mode DivideBy37 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy38                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy38 << 0) /**< Shifted mode DivideBy38 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy39                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy39 << 0) /**< Shifted mode DivideBy39 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy40                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy40 << 0) /**< Shifted mode DivideBy40 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy41                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy41 << 0) /**< Shifted mode DivideBy41 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy42                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy42 << 0) /**< Shifted mode DivideBy42 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy43                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy43 << 0) /**< Shifted mode DivideBy43 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy44                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy44 << 0) /**< Shifted mode DivideBy44 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy45                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy45 << 0) /**< Shifted mode DivideBy45 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy46                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy46 << 0) /**< Shifted mode DivideBy46 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy47                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy47 << 0) /**< Shifted mode DivideBy47 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy48                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy48 << 0) /**< Shifted mode DivideBy48 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy49                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy49 << 0) /**< Shifted mode DivideBy49 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy50                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy50 << 0) /**< Shifted mode DivideBy50 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy51                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy51 << 0) /**< Shifted mode DivideBy51 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy52                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy52 << 0) /**< Shifted mode DivideBy52 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy53                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy53 << 0) /**< Shifted mode DivideBy53 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy54                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy54 << 0) /**< Shifted mode DivideBy54 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy55                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy55 << 0) /**< Shifted mode DivideBy55 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy56                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy56 << 0) /**< Shifted mode DivideBy56 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy57                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy57 << 0) /**< Shifted mode DivideBy57 for ETAMPDET_CLKPRESCVAL*/
#define ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy58                                (_ETAMPDET_CLKPRESCVAL_LOWERPRESC_DivideBy58 << 0) /**< Shifted mode DivideBy58 for ETAMPDET_CLKPRESCVAL*/
